---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.CircuitLoadCalculationMethod.SumApparentLoad
enum: Autodesk.Revit.DB.Electrical.CircuitLoadCalculationMethod
source: html/d3ce255f-f1a1-7b52-a48c-320314213632.htm
---
# Autodesk.Revit.DB.Electrical.CircuitLoadCalculationMethod.SumApparentLoad

Sum apparent load.